** DONE Writing crystal structure visualization in OpenGL  2008 ShahidBeheshti University
   CLOSED: [2019-05-09 Thu 20:31]
   - State "DONE"       from "NEXT"       [2019-05-09 Thu 20:31]
   - State "NEXT"       from "TODO"       [2019-05-09 Thu 20:31]
   - State "TODO"       from ""           [2019-05-09 Thu 20:31]
   :LOGBOOK:
   CLOCK: [2008-05-01 Thu 11:45]--[2008-05-31 Sat 11:45] => 720:00
   :END:
   Done for Shahid Beheshti Physics Department, it was used to
   illustrate Crystal Structures, this project was written in C++,
   using GLUT as a window manager for openGL it was released
   internally as teaching asistat software for SolidState physics
   class

   - C++
   - GLUT
   - OpenGL

** DONE Data collection for Football League that idiot 2008 Freelance
   CLOSED: [2019-05-09 Thu 20:35]
   - State "DONE"       from "NEXT"       [2019-05-09 Thu 20:35]
   - State "NEXT"       from "TODO"       [2019-05-09 Thu 20:35]
   - State "TODO"       from ""           [2019-05-09 Thu 20:35]
   :LOGBOOK:
   CLOCK: [2009-04-03 Fri 11:53]--[2019-05-03 Fri 11:53] => 88368:00
   :END:
   this was a data Scraping project which constumer required a faster
   alternative to collect game data on different footbal legues, their
   php solution took about 1 hour to collect data due to sequencial
   execution, I created a BASH script and a python script which
   managed to collect data in less than a minute and updated MYSQL
   database.

   - Bash
   - python
   - MySQL
   
** DONE Mysql database sync to connect sales shop and warehouse 2008
   CLOSED: [2019-05-09 Thu 20:35]
   - State "DONE"       from "NEXT"       [2019-05-09 Thu 20:35]
   - State "NEXT"       from "TODO"       [2019-05-09 Thu 20:35]
   - State "TODO"       from ""           [2019-05-09 Thu 20:35]
   :LOGBOOK:
   CLOCK: [2009-08-03 Mon 11:58]--[2009-09-03 Thu 11:58] => 744:00
   :END:
   costumer wanted to sync shop database with ware house over
   unreliable internet connection which replication was not an option.
   we end up writing a costume backend which managed sync changes when
   ever the connection was available and get updates from warehouse to
   the sales shop.
   backend was written in php, database was MySQL
   - php
   - jQuerry
   - MySQL
** DONE Simulating Rocket tragectory to mars Python 2009 ShahidBeheshti University
   CLOSED: [2019-05-09 Thu 20:33]
   - State "DONE"       from "NEXT"       [2019-05-09 Thu 20:33]
   - State "NEXT"       from "TODO"       [2019-05-09 Thu 20:32]
   - State "TODO"       from ""           [2019-05-09 Thu 20:32]
   :LOGBOOK:
   CLOCK: [2009-07-03 Fri 11:48]--[2009-08-03 Mon 11:48] => 744:00
   :END:
   a simulation program which was completed in computational
   course in summer. using python i created solar system movement
   simulator and then using Dynamic Programming techniques i
   calculated tragectory for rocket leaving earth to enter mars orbit
   - python
** DONE Collecting Irans publication network from Scopus 2010 shahid Beheshti
   CLOSED: [2019-05-09 Thu 20:30]
   - State "DONE"       from "NEXT"       [2019-05-09 Thu 20:30]
   - State "NEXT"       from "TODO"       [2019-05-09 Thu 20:30]
   - State "TODO"       from ""           [2019-05-09 Thu 20:29]
   - State "TODO"       from ""           [2019-05-09 Thu 20:29]
   :LOGBOOK:
   CLOCK: [2010-09-03 Sun 13:44]--[2011-01-03 Mon 13:44] => 2929:00
   :END:
   In this project we collected publication information and abstract
   of all published papers in iran from Scopus website. Using
   Sentimental analysis and Natural Language processing we extracted
   irans scientific communities and key players in that network.
   - Python
   - NLTK
   - Scipy
   - numpy
   - sqlite
** DONE working on fraud detection ( Shahid beheshti Cyber space center) 2012
   CLOSED: [2019-05-09 Thu 20:31]
   - State "DONE"       from "NEXT"       [2019-05-09 Thu 20:31]
   - State "NEXT"       from "TODO"       [2019-05-09 Thu 20:31]
   - State "TODO"       from ""           [2019-05-09 Thu 20:31]
   :LOGBOOK:
   CLOCK: [2012-05-01 Tue 12:05]--[2012-11-03 Sat 12:05] => 4465:00
   :END:
   Working on a java based platform for detecting plagiarism in Thesis
   for ShahidBeheshti University.
   I was first introduced to java there.
   - Java
** DONE Serial Tracker and Downloader 2014 			       :hold:
   - State "HOLD"       from "WAITING"    [2019-05-09 Thu 20:35]
   - State "WAITING"    from "DONE"       [2019-05-09 Thu 20:35]
   - State "DONE"       from "NEXT"       [2019-05-09 Thu 20:35]
   - State "NEXT"       from "TODO"       [2019-05-09 Thu 20:35]
   - State "TODO"       from ""           [2019-05-09 Thu 20:35]
   :LOGBOOK:
   CLOCK: [2014-01-03 Fri 15:10]--[2014-03-03 Mon 15:10] => 1416:00
   :END:
   It was a personal system which followed relased date of series i
   was following on imdb and downloaded torrent of the said series
   episods. It started as a simple notification program to track when
   each episod is released then over time Automatic Download from
   Torrentz website was added, Then Decision for download based on
   comment analysis was added to the project.


   Python 
   Bittorrent
   BeautifulSoap
   NLTK -> sentimental Analysis based on Bag of words
** DONE Interactive Cataloge for hatampour 2017
   CLOSED: [2019-05-09 Thu 20:51]
   - State "DONE"       from "NEXT"       [2019-05-09 Thu 20:51]
   - State "NEXT"       from "TODO"       [2019-05-09 Thu 20:51]
   - State "TODO"       from ""           [2019-05-09 Thu 20:51]
   :LOGBOOK:
   CLOCK: [2017-07-01 Sat 15:55]--[2017-10-08 Sun 15:55] => 2377:00
   :END:
   augmented reality based project which superimposed  3d models of buildings
   with animation to the image feed.
   - Unity 3d
   - ARCore
   - Vuforia
   - Mobile
**** Collecting Iran's publication network from Scopus 2010--2011 IPM
     :LOGBOOK:
     CLOCK: [2010-09-03 Sun 13:44]--[2011-01-03 Mon 13:44] => 2929:00
     :END:
     In this project all publication affiliated with iran  was collected
     from scopus website. Using these information scientific network
     of iran was mapped and key researchers and hot research topics
     were identified. 

     Main tools used in this project are Python, NLTK, SciPy, NumPy
     and sqlite database.
**** Plagiarism Detection System
     :LOGBOOK:
     CLOCK: [2012-05-01 Tue 12:05]--[2012-11-03 Sat 12:05] => 4465:00
     :END:
     The system was designed to receive Thesis in different formats
     and analyse them based on different similarity metrics to detect
     plagiarism.
*** Interactive Cataloge for hatampour 2017
    :LOGBOOK:
    CLOCK: [2017-07-01 Sat 15:55]--[2017-10-08 Sun 15:55] => 2377:00
    :END:
    augmented reality based project which superimposed  3d models of buildings
    with animation to the image feed.
    - Unity 3d
    - ARCore
    - Vuforia
    - Mobile
*** Data collection for Football League that idiot 2008 Freelance
    :LOGBOOK:
    CLOCK: [2009-04-03 Fri 11:53]--[2019-05-03 Fri 11:53] => 88368:00
    :END:
    this was a data Scraping project which constumer required a faster
    alternative to collect game data on different footbal legues, their
    php solution took about 1 hour to collect data due to sequencial
    execution, I created a BASH script and a python script which
    managed to collect data in less than a minute and updated MYSQL
    database.

    - Bash
    - python
    - MySQL
    
*** Mysql database sync to connect sales shop and warehouse 2008
    :LOGBOOK:
    CLOCK: [2009-08-03 Mon 11:58]--[2009-09-03 Thu 11:58] => 744:00
    :END:
    costumer wanted to sync shop database with ware house over
    unreliable internet connection which replication was not an option.
    we end up writing a costume backend which managed sync changes when
    ever the connection was available and get updates from warehouse to
    the sales shop.
    backend was written in php, database was MySQL
    - php
    - jQuerry
      - MySQL
*** Serial Tracker and Downloader 2014
    :LOGBOOK:
    CLOCK: [2014-01-03 Fri 15:10]--[2014-03-03 Mon 15:10] => 1416:00
    :END:
    It was a personal system which followed relased date of series i
    was following on imdb and downloaded torrent of the said series
    episods. It started as a simple notification program to track when
    each episod is released then over time Automatic Download from
    Torrentz website was added, Then Decision for download based on
    comment analysis was added to the project.


    Python 
    Bittorrent
    BeautifulSoap
    NLTK -> sentimental Analysis based on Bag of words
